详情结果/原始结果/scylla_runD.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:cassandra-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/cassandra/conf:/home/YCSB/cassandra/target/cassandra-binding-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/io/dropwizard/metrics/metrics-core/3.1.2/metrics-core-3.1.2.jar:/root/.m2/repository/com/datastax/cassandra/cassandra-driver-core/3.0.0/cassandra-driver-core-3.0.0.jar:/root/.m2/repository/io/netty/netty-handler/4.0.33.Final/netty-handler-4.0.33.Final.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/io/netty/netty-transport/4.0.33.Final/netty-transport-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-codec/4.0.33.Final/netty-codec-4.0.33.Final.jar:/root/.m2/repository/com/google/guava/guava/16.0.1/guava-16.0.1.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/io/netty/netty-buffer/4.0.33.Final/netty-buffer-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-common/4.0.33.Final/netty-common-4.0.33.Final.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadd -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadd -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2018-12-28 19:51:59:298 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-28 19:52:09:270 10 sec: 136709 operations; 13670.9 current ops/sec; est completion in 12 minutes [READ: Count=129838, Max=101055, Min=2050, Avg=6983.28, 90=8743, 99=16215, 99.9=24319, 99.99=92799] [INSERT: Count=6882, Max=77311, Min=2628, Avg=5338.53, 90=6639, 99=9391, 99.9=17295, 99.99=76223] 
2018-12-28 19:52:19:270 20 sec: 294120 operations; 15741.1 current ops/sec; est completion in 11 minutes [READ: Count=149401, Max=24303, Min=2080, Avg=6425.54, 90=7859, 99=14743, 99.9=18783, 99.99=21791] [INSERT: Count=8009, Max=11671, Min=2314, Avg=4936.18, 90=6075, 99=7151, 99.9=8655, 99.99=11199] 
2018-12-28 19:52:29:270 30 sec: 450582 operations; 15646.2 current ops/sec; est completion in 10 minutes [READ: Count=148644, Max=26511, Min=1956, Avg=6465.7, 90=7899, 99=15055, 99.9=19135, 99.99=22687] [INSERT: Count=7817, Max=8887, Min=2508, Avg=4955.7, 90=6127, 99=7195, 99.9=8135, 99.99=8727] 
2018-12-28 19:52:39:270 40 sec: 605976 operations; 15539.4 current ops/sec; est completion in 10 minutes [READ: Count=147621, Max=25439, Min=2096, Avg=6509.15, 90=7983, 99=15223, 99.9=19359, 99.99=23023] [INSERT: Count=7778, Max=9151, Min=2792, Avg=4996.36, 90=6159, 99=7351, 99.9=8327, 99.99=9039] 
2018-12-28 19:52:49:271 50 sec: 760190 operations; 15421.4 current ops/sec; est completion in 10 minutes [READ: Count=146475, Max=26063, Min=2031, Avg=6557.83, 90=8047, 99=15399, 99.9=19375, 99.99=22463] [INSERT: Count=7736, Max=9759, Min=2674, Avg=5049.14, 90=6235, 99=7439, 99.9=8511, 99.99=9375] 
2018-12-28 19:52:59:270 60 sec: 912811 operations; 15262.1 current ops/sec; est completion in 9 minutes [READ: Count=144916, Max=29407, Min=2017, Avg=6630.14, 90=8279, 99=15319, 99.9=19999, 99.99=24799] [INSERT: Count=7701, Max=9823, Min=2660, Avg=5063.76, 90=6311, 99=7871, 99.9=9527, 99.99=9727] 
2018-12-28 19:53:09:270 70 sec: 1059916 operations; 14710.5 current ops/sec; est completion in 9 minutes [READ: Count=139677, Max=32319, Min=2224, Avg=6881.22, 90=8727, 99=15919, 99.9=21151, 99.99=25903] [INSERT: Count=7434, Max=11679, Min=2532, Avg=5198.75, 90=6499, 99=8151, 99.9=10583, 99.99=11671] 
2018-12-28 19:53:19:270 80 sec: 1213847 operations; 15393.1 current ops/sec; est completion in 9 minutes [READ: Count=146190, Max=25295, Min=2320, Avg=6572.58, 90=8067, 99=15367, 99.9=19551, 99.99=22335] [INSERT: Count=7728, Max=11359, Min=2576, Avg=5022.28, 90=6191, 99=7411, 99.9=8575, 99.99=9287] 
2018-12-28 19:53:29:270 90 sec: 1368811 operations; 15496.4 current ops/sec; est completion in 9 minutes [READ: Count=147161, Max=30175, Min=1309, Avg=6528.6, 90=7999, 99=15295, 99.9=19215, 99.99=22975] [INSERT: Count=7808, Max=9327, Min=2472, Avg=5018.35, 90=6211, 99=7451, 99.9=8543, 99.99=9287] 
2018-12-28 19:53:39:270 100 sec: 1522670 operations; 15385.9 current ops/sec; est completion in 9 minutes [READ: Count=146105, Max=25631, Min=2278, Avg=6575.16, 90=8051, 99=15527, 99.9=19615, 99.99=22895] [INSERT: Count=7750, Max=9183, Min=2540, Avg=5024.86, 90=6179, 99=7447, 99.9=8471, 99.99=8831] 
2018-12-28 19:53:49:270 110 sec: 1677346 operations; 15467.6 current ops/sec; est completion in 9 minutes [READ: Count=147009, Max=28591, Min=2322, Avg=6539.76, 90=8031, 99=15487, 99.9=19567, 99.99=22799] [INSERT: Count=7677, Max=9735, Min=2562, Avg=5018.47, 90=6259, 99=7539, 99.9=8911, 99.99=9631] 
2018-12-28 19:53:59:270 120 sec: 1828591 operations; 15124.5 current ops/sec; est completion in 8 minutes [READ: Count=143516, Max=30271, Min=2138, Avg=6692.16, 90=8327, 99=15695, 99.9=20559, 99.99=24175] [INSERT: Count=7718, Max=10999, Min=2322, Avg=5093.35, 90=6339, 99=7647, 99.9=9047, 99.99=10407] 
2018-12-28 19:54:09:270 130 sec: 1975593 operations; 14700.2 current ops/sec; est completion in 8 minutes [READ: Count=139732, Max=29311, Min=2320, Avg=6883.1, 90=8647, 99=16103, 99.9=21103, 99.99=25183] [INSERT: Count=7274, Max=11047, Min=2696, Avg=5204.59, 90=6499, 99=8155, 99.9=9583, 99.99=10975] 
2018-12-28 19:54:19:270 140 sec: 2129235 operations; 15364.2 current ops/sec; est completion in 8 minutes [READ: Count=145960, Max=30111, Min=2156, Avg=6586.87, 90=8131, 99=15519, 99.9=19743, 99.99=23583] [INSERT: Count=7684, Max=10239, Min=2498, Avg=5005.66, 90=6187, 99=7459, 99.9=8359, 99.99=10063] 
2018-12-28 19:54:29:270 150 sec: 2283659 operations; 15442.4 current ops/sec; est completion in 8 minutes [READ: Count=146761, Max=26671, Min=1400, Avg=6550.08, 90=8027, 99=15647, 99.9=19695, 99.99=23247] [INSERT: Count=7676, Max=8503, Min=2556, Avg=5026.71, 90=6159, 99=7255, 99.9=8023, 99.99=8415] 
2018-12-28 19:54:39:270 160 sec: 2438149 operations; 15449 current ops/sec; est completion in 8 minutes [READ: Count=146833, Max=26735, Min=2202, Avg=6545.65, 90=8039, 99=15527, 99.9=19727, 99.99=23135] [INSERT: Count=7658, Max=9655, Min=2306, Avg=5039.21, 90=6275, 99=7551, 99.9=8719, 99.99=8911] 
2018-12-28 19:54:49:270 170 sec: 2593872 operations; 15572.3 current ops/sec; est completion in 8 minutes [READ: Count=147994, Max=25727, Min=1302, Avg=6495.68, 90=7947, 99=15535, 99.9=19391, 99.99=22255] [INSERT: Count=7725, Max=10031, Min=2240, Avg=4982.14, 90=6135, 99=7431, 99.9=8671, 99.99=9687] 
2018-12-28 19:54:59:270 180 sec: 2746858 operations; 15298.6 current ops/sec; est completion in 7 minutes [READ: Count=145319, Max=26831, Min=2072, Avg=6612.96, 90=8215, 99=15759, 99.9=20399, 99.99=23807] [INSERT: Count=7655, Max=9679, Min=2470, Avg=5057.46, 90=6259, 99=7707, 99.9=8823, 99.99=9527] 
2018-12-28 19:55:09:270 190 sec: 2893819 operations; 14696.1 current ops/sec; est completion in 7 minutes [READ: Count=139468, Max=30319, Min=2432, Avg=6888.83, 90=8647, 99=16231, 99.9=21663, 99.99=26511] [INSERT: Count=7497, Max=11311, Min=2572, Avg=5210.49, 90=6511, 99=8383, 99.9=10247, 99.99=11031] 
2018-12-28 19:55:19:270 200 sec: 3046525 operations; 15270.6 current ops/sec; est completion in 7 minutes [READ: Count=144961, Max=32335, Min=1632, Avg=6626.63, 90=8279, 99=15607, 99.9=20351, 99.99=25391] [INSERT: Count=7737, Max=11935, Min=2664, Avg=5055.9, 90=6267, 99=8039, 99.9=10079, 99.99=11095] 
2018-12-28 19:55:29:270 210 sec: 3202108 operations; 15558.3 current ops/sec; est completion in 7 minutes [READ: Count=147808, Max=26415, Min=2466, Avg=6502.1, 90=8027, 99=15351, 99.9=19727, 99.99=23263] [INSERT: Count=7775, Max=9327, Min=2348, Avg=4958.52, 90=6115, 99=7387, 99.9=8503, 99.99=8927] 
2018-12-28 19:55:39:270 220 sec: 3358432 operations; 15632.4 current ops/sec; est completion in 7 minutes [READ: Count=148597, Max=25679, Min=2128, Avg=6469.14, 90=7959, 99=15311, 99.9=19519, 99.99=22623] [INSERT: Count=7728, Max=11935, Min=2120, Avg=4980.73, 90=6179, 99=7367, 99.9=8551, 99.99=10383] 
2018-12-28 19:55:49:270 230 sec: 3513640 operations; 15520.8 current ops/sec; est completion in 7 minutes [READ: Count=147395, Max=27999, Min=2138, Avg=6517.32, 90=8019, 99=15367, 99.9=19407, 99.99=22591] [INSERT: Count=7815, Max=10335, Min=2528, Avg=5015.58, 90=6231, 99=7387, 99.9=8871, 99.99=9959] 
2018-12-28 19:55:59:270 240 sec: 3666128 operations; 15248.8 current ops/sec; est completion in 6 minutes [READ: Count=144772, Max=36543, Min=1243, Avg=6634.83, 90=8215, 99=15527, 99.9=20031, 99.99=24303] [INSERT: Count=7714, Max=11775, Min=2636, Avg=5089.15, 90=6319, 99=8075, 99.9=9663, 99.99=11175] 
2018-12-28 19:56:09:270 250 sec: 3816326 operations; 15019.8 current ops/sec; est completion in 6 minutes [READ: Count=142724, Max=31679, Min=1259, Avg=6736.84, 90=8407, 99=15855, 99.9=20623, 99.99=24447] [INSERT: Count=7481, Max=10279, Min=2584, Avg=5099.46, 90=6343, 99=7795, 99.9=9335, 99.99=10223] 
2018-12-28 19:56:19:270 260 sec: 3964793 operations; 14846.7 current ops/sec; est completion in 6 minutes [READ: Count=141141, Max=39871, Min=1033, Avg=6816.63, 90=8583, 99=16063, 99.9=21439, 99.99=27919] [INSERT: Count=7320, Max=12631, Min=2780, Avg=5162.55, 90=6443, 99=8359, 99.9=10375, 99.99=11183] 
2018-12-28 19:56:29:270 270 sec: 4120520 operations; 15572.7 current ops/sec; est completion in 6 minutes [READ: Count=147967, Max=25871, Min=2368, Avg=6495.86, 90=7943, 99=15383, 99.9=19583, 99.99=22719] [INSERT: Count=7761, Max=9799, Min=2376, Avg=4966.58, 90=6111, 99=7287, 99.9=8607, 99.99=9159] 
2018-12-28 19:56:39:270 280 sec: 4276287 operations; 15576.7 current ops/sec; est completion in 6 minutes [READ: Count=148050, Max=25631, Min=2052, Avg=6493.45, 90=7975, 99=15343, 99.9=19247, 99.99=22671] [INSERT: Count=7714, Max=9351, Min=2370, Avg=4991.65, 90=6163, 99=7335, 99.9=8503, 99.99=9319] 
2018-12-28 19:56:49:270 290 sec: 4431550 operations; 15526.3 current ops/sec; est completion in 6 minutes [READ: Count=147420, Max=29071, Min=2037, Avg=6516.31, 90=7983, 99=15407, 99.9=19519, 99.99=22943] [INSERT: Count=7847, Max=9079, Min=2464, Avg=4985.53, 90=6159, 99=7379, 99.9=8447, 99.99=8951] 
2018-12-28 19:56:59:270 300 sec: 4584657 operations; 15310.7 current ops/sec; est completion in 5 minutes [READ: Count=145501, Max=26319, Min=1840, Avg=6605.7, 90=8159, 99=15583, 99.9=20143, 99.99=23311] [INSERT: Count=7614, Max=10415, Min=2534, Avg=5068.1, 90=6291, 99=7663, 99.9=9631, 99.99=10087] 
2018-12-28 19:57:09:270 310 sec: 4737266 operations; 15260.9 current ops/sec; est completion in 5 minutes [READ: Count=145057, Max=34559, Min=1005, Avg=6628.8, 90=8263, 99=15583, 99.9=20591, 99.99=25839] [INSERT: Count=7547, Max=12151, Min=2642, Avg=5067.36, 90=6315, 99=8447, 99.9=10399, 99.99=12127] 
2018-12-28 19:57:19:270 320 sec: 4889606 operations; 15234 current ops/sec; est completion in 5 minutes [READ: Count=144708, Max=28063, Min=2292, Avg=6642.33, 90=8279, 99=15543, 99.9=20479, 99.99=24367] [INSERT: Count=7625, Max=10551, Min=2460, Avg=5051.21, 90=6255, 99=7659, 99.9=8879, 99.99=10031] 
2018-12-28 19:57:29:270 330 sec: 5045253 operations; 15564.7 current ops/sec; est completion in 5 minutes [READ: Count=147904, Max=26271, Min=943, Avg=6497.06, 90=7967, 99=15199, 99.9=19551, 99.99=22767] [INSERT: Count=7743, Max=10479, Min=2612, Avg=5012.5, 90=6199, 99=7431, 99.9=8567, 99.99=9439] 
2018-12-28 19:57:39:270 340 sec: 5202521 operations; 15726.8 current ops/sec; est completion in 5 minutes [READ: Count=149279, Max=24623, Min=1954, Avg=6430.57, 90=7859, 99=15159, 99.9=19103, 99.99=22255] [INSERT: Count=7993, Max=9855, Min=2300, Avg=4954.12, 90=6095, 99=7283, 99.9=8623, 99.99=9727] 
2018-12-28 19:57:49:270 350 sec: 5359703 operations; 15718.2 current ops/sec; est completion in 5 minutes [READ: Count=149339, Max=26863, Min=2001, Avg=6438.27, 90=7883, 99=15159, 99.9=19055, 99.99=22079] [INSERT: Count=7841, Max=9703, Min=2572, Avg=4912.93, 90=6035, 99=7171, 99.9=8043, 99.99=9527] 
2018-12-28 19:57:59:270 360 sec: 5513700 operations; 15399.7 current ops/sec; est completion in 4 minutes [READ: Count=146193, Max=26063, Min=2340, Avg=6570.96, 90=8119, 99=15343, 99.9=19871, 99.99=23279] [INSERT: Count=7802, Max=10151, Min=2652, Avg=5024.84, 90=6219, 99=7543, 99.9=8607, 99.99=9487] 
2018-12-28 19:58:09:270 370 sec: 5667793 operations; 15409.3 current ops/sec; est completion in 4 minutes [READ: Count=146410, Max=26511, Min=1249, Avg=6565.07, 90=8123, 99=15383, 99.9=20031, 99.99=23679] [INSERT: Count=7687, Max=10687, Min=2426, Avg=5003.34, 90=6203, 99=7623, 99.9=8839, 99.99=9863] 
2018-12-28 19:58:19:270 380 sec: 5818194 operations; 15040.1 current ops/sec; est completion in 4 minutes [READ: Count=143036, Max=29679, Min=1173, Avg=6726.25, 90=8471, 99=15671, 99.9=20751, 99.99=24703] [INSERT: Count=7361, Max=11143, Min=2672, Avg=5109.86, 90=6383, 99=7923, 99.9=9487, 99.99=10559] 
2018-12-28 19:58:29:270 390 sec: 5975038 operations; 15684.4 current ops/sec; est completion in 4 minutes [READ: Count=149046, Max=26031, Min=1203, Avg=6449.59, 90=7887, 99=15159, 99.9=19199, 99.99=23279] [INSERT: Count=7809, Max=10735, Min=2632, Avg=4954.47, 90=6075, 99=7179, 99.9=8199, 99.99=9183] 
2018-12-28 19:58:39:270 400 sec: 6130562 operations; 15552.4 current ops/sec; est completion in 4 minutes [READ: Count=147842, Max=25983, Min=2276, Avg=6503.12, 90=7995, 99=15223, 99.9=19279, 99.99=23055] [INSERT: Count=7676, Max=11327, Min=2418, Avg=4970.7, 90=6135, 99=7423, 99.9=8735, 99.99=9663] 
2018-12-28 19:58:49:270 410 sec: 6285931 operations; 15536.9 current ops/sec; est completion in 4 minutes [READ: Count=147603, Max=29983, Min=2262, Avg=6510.31, 90=7983, 99=15335, 99.9=19423, 99.99=22863] [INSERT: Count=7761, Max=10247, Min=2510, Avg=5003.2, 90=6187, 99=7403, 99.9=8583, 99.99=9359] 
2018-12-28 19:58:59:270 420 sec: 6439428 operations; 15349.7 current ops/sec; est completion in 3 minutes [READ: Count=145805, Max=27503, Min=1865, Avg=6591.75, 90=8159, 99=15287, 99.9=19807, 99.99=22879] [INSERT: Count=7705, Max=9071, Min=2678, Avg=5037.88, 90=6223, 99=7563, 99.9=8575, 99.99=8975] 
2018-12-28 19:59:09:270 430 sec: 6594182 operations; 15475.4 current ops/sec; est completion in 3 minutes [READ: Count=146981, Max=40479, Min=2004, Avg=6535.59, 90=8095, 99=15199, 99.9=19887, 99.99=25375] [INSERT: Count=7768, Max=11415, Min=2212, Avg=5023.26, 90=6219, 99=7727, 99.9=9607, 99.99=10799] 
2018-12-28 19:59:19:270 440 sec: 6742777 operations; 14859.5 current ops/sec; est completion in 3 minutes [READ: Count=141096, Max=33343, Min=1126, Avg=6810.86, 90=8551, 99=15663, 99.9=20831, 99.99=25583] [INSERT: Count=7491, Max=12535, Min=2448, Avg=5185.19, 90=6463, 99=8271, 99.9=10343, 99.99=12239] 
2018-12-28 19:59:29:270 450 sec: 6890660 operations; 14788.3 current ops/sec; est completion in 3 minutes [READ: Count=140415, Max=33375, Min=2292, Avg=6844.16, 90=8687, 99=15743, 99.9=20991, 99.99=26095] [INSERT: Count=7474, Max=13231, Min=2516, Avg=5174.06, 90=6491, 99=8163, 99.9=10343, 99.99=13207] 
2018-12-28 19:59:39:270 460 sec: 7047997 operations; 15733.7 current ops/sec; est completion in 3 minutes [READ: Count=149531, Max=33599, Min=1110, Avg=6427.64, 90=7907, 99=14919, 99.9=18975, 99.99=22287] [INSERT: Count=7804, Max=10543, Min=2638, Avg=4954, 90=6111, 99=7479, 99.9=8735, 99.99=9607] 
2018-12-28 19:59:49:270 470 sec: 7205562 operations; 15756.5 current ops/sec; est completion in 3 minutes [READ: Count=149630, Max=26495, Min=806, Avg=6419.65, 90=7883, 99=14911, 99.9=18959, 99.99=21935] [INSERT: Count=7931, Max=10687, Min=2362, Avg=4941.1, 90=6099, 99=7351, 99.9=8639, 99.99=10551] 
2018-12-28 19:59:59:270 480 sec: 7359597 operations; 15403.5 current ops/sec; est completion in 2 minutes [READ: Count=146312, Max=27343, Min=2106, Avg=6567.87, 90=8139, 99=15335, 99.9=20031, 99.99=23871] [INSERT: Count=7735, Max=11703, Min=2612, Avg=5028.27, 90=6231, 99=7607, 99.9=9143, 99.99=11639] 
2018-12-28 20:00:09:270 490 sec: 7515732 operations; 15613.5 current ops/sec; est completion in 2 minutes [READ: Count=148441, Max=26639, Min=2302, Avg=6477.15, 90=7975, 99=15079, 99.9=19135, 99.99=22991] [INSERT: Count=7691, Max=9919, Min=2506, Avg=4969.86, 90=6139, 99=7391, 99.9=8479, 99.99=9719] 
2018-12-28 20:00:19:270 500 sec: 7662289 operations; 14655.7 current ops/sec; est completion in 2 minutes [READ: Count=139212, Max=34015, Min=1467, Avg=6906.89, 90=8951, 99=15663, 99.9=22079, 99.99=28287] [INSERT: Count=7336, Max=12655, Min=2592, Avg=5211.03, 90=6555, 99=8583, 99.9=10631, 99.99=12543] 
2018-12-28 20:00:29:270 510 sec: 7819894 operations; 15760.5 current ops/sec; est completion in 2 minutes [READ: Count=149674, Max=24431, Min=1180, Avg=6418.12, 90=7871, 99=14903, 99.9=18943, 99.99=22383] [INSERT: Count=7932, Max=9167, Min=2118, Avg=4933.64, 90=6063, 99=7175, 99.9=8223, 99.99=8823] 
2018-12-28 20:00:39:270 520 sec: 7977019 operations; 15712.5 current ops/sec; est completion in 2 minutes [READ: Count=149489, Max=25551, Min=2011, Avg=6435.25, 90=7895, 99=14983, 99.9=19199, 99.99=22415] [INSERT: Count=7637, Max=9887, Min=2454, Avg=4951.32, 90=6119, 99=7407, 99.9=8391, 99.99=9791] 
2018-12-28 20:00:49:270 530 sec: 8133659 operations; 15664 current ops/sec; est completion in 2 minutes [READ: Count=148772, Max=26783, Min=1077, Avg=6458.19, 90=7899, 99=15063, 99.9=19151, 99.99=22959] [INSERT: Count=7874, Max=10327, Min=2566, Avg=4951.29, 90=6143, 99=7419, 99.9=8799, 99.99=10175] 
2018-12-28 20:00:59:270 540 sec: 8288383 operations; 15472.4 current ops/sec; est completion in 1 minute [READ: Count=147020, Max=26847, Min=2020, Avg=6536.53, 90=8039, 99=15087, 99.9=19631, 99.99=23167] [INSERT: Count=7699, Max=11063, Min=2722, Avg=5018.08, 90=6191, 99=7455, 99.9=9583, 99.99=11039] 
2018-12-28 20:01:09:270 550 sec: 8442774 operations; 15439.1 current ops/sec; est completion in 1 minute [READ: Count=146791, Max=29007, Min=2168, Avg=6551.6, 90=8175, 99=14975, 99.9=19743, 99.99=24831] [INSERT: Count=7616, Max=9887, Min=2616, Avg=5018.05, 90=6243, 99=7683, 99.9=9079, 99.99=9575] 
2018-12-28 20:01:19:270 560 sec: 8591315 operations; 14854.1 current ops/sec; est completion in 1 minute [READ: Count=141170, Max=38975, Min=2466, Avg=6811.88, 90=8711, 99=15591, 99.9=21503, 99.99=28671] [INSERT: Count=7366, Max=11551, Min=2640, Avg=5177.85, 90=6487, 99=8855, 99.9=10535, 99.99=11535] 
2018-12-28 20:01:29:270 570 sec: 8746479 operations; 15516.4 current ops/sec; est completion in 1 minute [READ: Count=147454, Max=29087, Min=1096, Avg=6517.99, 90=7991, 99=15143, 99.9=19471, 99.99=23551] [INSERT: Count=7703, Max=9991, Min=2464, Avg=5005.97, 90=6215, 99=7503, 99.9=8655, 99.99=9511] 
2018-12-28 20:01:39:270 580 sec: 8904865 operations; 15838.6 current ops/sec; est completion in 1 minute [READ: Count=150333, Max=25423, Min=1705, Avg=6387.04, 90=7843, 99=14767, 99.9=19103, 99.99=22847] [INSERT: Count=8046, Max=9199, Min=2142, Avg=4922.24, 90=6055, 99=7295, 99.9=8391, 99.99=9167] 
2018-12-28 20:01:49:270 590 sec: 9062423 operations; 15755.8 current ops/sec; est completion in 1 minute [READ: Count=149699, Max=25999, Min=1369, Avg=6417.84, 90=7883, 99=14863, 99.9=19199, 99.99=22399] [INSERT: Count=7871, Max=9143, Min=2318, Avg=4949.84, 90=6079, 99=7271, 99.9=8447, 99.99=9103] 
2018-12-28 20:01:59:270 600 sec: 9217820 operations; 15539.7 current ops/sec; est completion in 51 seconds [READ: Count=147586, Max=34079, Min=1780, Avg=6509.51, 90=8043, 99=14935, 99.9=19327, 99.99=22991] [INSERT: Count=7816, Max=10095, Min=2268, Avg=5008.23, 90=6199, 99=7663, 99.9=9191, 99.99=9639] 
2018-12-28 20:02:09:270 610 sec: 9374547 operations; 15672.7 current ops/sec; est completion in 41 seconds [READ: Count=148882, Max=25583, Min=1217, Avg=6454.41, 90=7955, 99=14871, 99.9=19151, 99.99=22799] [INSERT: Count=7828, Max=9367, Min=2014, Avg=4944.36, 90=6099, 99=7407, 99.9=8535, 99.99=9223] 
2018-12-28 20:02:19:270 620 sec: 9525321 operations; 15077.4 current ops/sec; est completion in 31 seconds [READ: Count=143266, Max=30751, Min=2037, Avg=6711.47, 90=8415, 99=15247, 99.9=20607, 99.99=24559] [INSERT: Count=7513, Max=11935, Min=2662, Avg=5093.29, 90=6355, 99=7839, 99.9=8991, 99.99=9959] 
2018-12-28 20:02:29:270 630 sec: 9682437 operations; 15711.6 current ops/sec; est completion in 21 seconds [READ: Count=149080, Max=27503, Min=2418, Avg=6439.62, 90=7907, 99=15031, 99.9=19039, 99.99=22831] [INSERT: Count=8032, Max=9303, Min=2554, Avg=4947.83, 90=6091, 99=7331, 99.9=8471, 99.99=8983] 
2018-12-28 20:02:39:270 640 sec: 9838976 operations; 15653.9 current ops/sec; est completion in 11 seconds [READ: Count=148713, Max=27071, Min=2320, Avg=6461.28, 90=7883, 99=14935, 99.9=18975, 99.99=22495] [INSERT: Count=7825, Max=9295, Min=2084, Avg=4961.89, 90=6119, 99=7299, 99.9=8799, 99.99=9231] 
2018-12-28 20:02:49:270 650 sec: 9994581 operations; 15560.5 current ops/sec; est completion in 1 second [READ: Count=147861, Max=28543, Min=1895, Avg=6460.92, 90=7931, 99=14975, 99.9=19231, 99.99=23199] [CLEANUP: Count=25, Max=8, Min=0, Avg=1.8, 90=4, 99=8, 99.9=8, 99.99=8] [INSERT: Count=7744, Max=11023, Min=2116, Avg=4989.37, 90=6187, 99=7395, 99.9=8767, 99.99=10255] 
2018-12-28 20:02:51:949 652 sec: 10000000 operations; 2022.77 current ops/sec; [READ: Count=5130, Max=13927, Min=439, Avg=3387.05, 90=5367, 99=7119, 99.9=11991, 99.99=12919] [CLEANUP: Count=75, Max=2215935, Min=0, Avg=29533.48, 90=1, 99=73, 99.9=2215935, 99.99=2215935] [INSERT: Count=289, Max=5727, Min=608, Avg=3204.33, 90=4483, 99=5527, 99.9=5727, 99.99=5727] 
[OVERALL], RunTime(ms), 652678
[OVERALL], Throughput(ops/sec), 15321.490842344923
[TOTAL_GCS_PS_Scavenge], Count, 1008
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1731
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2652150064809906
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1008
[TOTAL_GC_TIME], Time(ms), 1731
[TOTAL_GC_TIME_%], Time(%), 0.2652150064809906
[READ], Operations, 9499716
[READ], AverageLatency(us), 6571.214172718426
[READ], MinLatency(us), 439
[READ], MaxLatency(us), 101055
[READ], 95thPercentileLatency(us), 8951
[READ], 99thPercentileLatency(us), 15359
[READ], Return=OK, 9499716
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22150.56
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2215935
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 73
[INSERT], Operations, 500284
[INSERT], AverageLatency(us), 5028.975012193075
[INSERT], MinLatency(us), 608
[INSERT], MaxLatency(us), 77311
[INSERT], 95thPercentileLatency(us), 6659
[INSERT], 99thPercentileLatency(us), 7635
[INSERT], Return=OK, 500284